// Задание 1

// Задаем произвольный текст-пароль
// let correctPassword = 'пароль';

// // Запрашиваем у пользователя ввод пароля
// let userPassword = prompt('Введите пароль:');

// // Проверяем введенный пароль
// if (userPassword === correctPassword) {
//   alert('Пароль введен верно.');
// } else {
//   alert('Пароль введен неправильно.');
// }

// Задание 2
// Создаем переменную и присваиваем ей любое число
// let c;

// // Проверяем условие с использованием логического оператора &&
// c = 0;
// if (c > 0 && c < 10) {
//   console.log('Верно');
// } else {
//   console.log('Неверно');
// }

// c = 10;
// if (c > 0 && c < 10) {
//   console.log('Верно');
// } else {
//   console.log('Неверно');
// }

// c = -3;
// if (c > 0 && c < 10) {
//   console.log('Верно');
// } else {
//   console.log('Неверно');
// }

// c = 2;
// if (c > 0 && c < 10) {
//   console.log('Верно');
// } else {
//   console.log('Неверно');
// }

// Задание 3

// Создаем две переменные и присваиваем им любые числа
let d = 50;
let e = 120;

// Проверяем условие с использованием логического оператора ||
if (d > 100 || e > 100) {
  console.log('Верно');
} else {
  console.log('Неверно');
}


